Terraform plan for __production__
<details>
  <summary>Plan: 9 to add, 4 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                 = true -> false
        id                         = "6c7bb33f-a84c-4bce-94d4-635bb12bf107"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "tK94+/da+/fYULqmF7N/pZI9+KuwS83ZqN0R5x4H1iE=" -> "1+OKeHegir68zibVWQprtvKLPJgNzQdWLevSpHpr7JI="
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db will be updated in-place
  ~ resource "cloudfoundry_service_instance" "db" {
        id                             = "727f67a1-e003-4661-a56c-22e849c8af7b"
        name                           = "ssb-eks-db"
      ~ replace_on_service_plan_change = true -> false
        tags                           = [
            "mysql",
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-smtp"
      + path                       = "./app-ssb-smtp.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "sK75fPzOF7rv5LlNmMzGvTwO0IrtFqy7sDmiuTQAjnE="
      + space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_smtp.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-smtp-gsa-datagov-management"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-datagov-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "acbabadb-2604-4736-81f7-01288b0371c6"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-datagov-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-smtp-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
      + space                          = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags                           = [
          + "mysql",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.broker_smtp.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.broker_smtp.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                 = true -> false
        id                         = "3927b4b7-78bc-48ec-8bab-42a1e2998026"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
      ~ source_code_hash           = "4zPyUddjS0HqAuptRu2PLMJIkaCjdPaaxMZgueWZsbQ=" -> "Pm7XppCHsmPfIRIydJtvESofhyObkEfv1u+IA7pVYP4="
        # (17 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_service_instance.db will be updated in-place
  ~ resource "cloudfoundry_service_instance" "db" {
        id                             = "4c682b52-1f15-438d-9e4d-621a1d9c3e22"
        name                           = "ssb-solr-db"
      ~ replace_on_service_plan_change = true -> false
        tags                           = [
            "mysql",
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 4 to change, 0 to destroy.
```
</details>

Plan generated in [plan #100](https://github.com/GSA/datagov-ssb/actions/runs/994854471)